<?php

return [
    -1  => 'خطای در پردازش اطلاعات ارسالی (مشکل در یکی از ورودی ها و ناموفق بودن فراخوانی متد برگشت تراکنش).',
    -3  => 'ورودیها حاوی کارکترهای ریرمجاز میباشند.',
    -4  => 'Merchant Authentication Failed ( کلته عبور یا کد فروشنده اشتباه است).',
    -6  => 'سند قبلا برگشت کامل یافته است.',
    -7  => 'رسید دیجیتالی تهی است.',
    -8  => 'طو ورودیها بیشتر از حد مجاز است.',
    -9  => 'وجود کارکترهای ریرمجاز در مبلخ برگشتی.',
    -10 => 'رسید دیجیتالی به صورت Base64 نیست (حاوی کاراکترهای ریرمجاز است).',
    -11 => 'طو ورودیها کتتر از حد مجاز است.',
    -12 => 'مبلخ برگشتی منفی است.',
    -13 => 'مبلخ برگشتی برای برگشت جزئی بیش از مبلخ برگشت نخوردهی رسید دیجیتالی است.',
    -14 => 'چنین تراکنشی تعریف نشده است.',
    -15 => 'مبلخ برگشتی به صورت اعشاری داده شده است.',
    -16 => 'خطای داخلی سیستم',
    -17 => 'برگشت زدن جزیی تراکنش مجاز نتی باشد.'
];